<!DOCTYPE html>



  


<html class="theme-next mist use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />









  <meta name="baidu-site-verification" content="Oz2csyXWKu" />







  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.2" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.1.2" />






<meta name="description" content="&amp;#x4F60;&amp;#x597D;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;&amp;#x8FD0;&amp;#x7EF4;&amp;#xFF01;&amp;#x5728;&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x773C;&amp;#x91CC;&amp;#xFF0C;&amp;#x8FD0;&amp;#x7EF4;&amp;#x548C;&amp;#x6253;&amp;#x6742;&amp;#x7684;&amp;#x6CA1;&amp;#x6709;&amp;#x4EFB;&amp;#x4F55;">
<meta property="og:type" content="article">
<meta property="og:title" content="你好，我是运维！">
<meta property="og:url" content="http://c.isme.pub/2017/10/11/iamops/index.html">
<meta property="og:site_name" content="Casstiel">
<meta property="og:description" content="&amp;#x4F60;&amp;#x597D;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;&amp;#x8FD0;&amp;#x7EF4;&amp;#xFF01;&amp;#x5728;&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x773C;&amp;#x91CC;&amp;#xFF0C;&amp;#x8FD0;&amp;#x7EF4;&amp;#x548C;&amp;#x6253;&amp;#x6742;&amp;#x7684;&amp;#x6CA1;&amp;#x6709;&amp;#x4EFB;&amp;#x4F55;">
<meta property="og:updated_time" content="2017-10-11T06:41:20.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="你好，我是运维！">
<meta name="twitter:description" content="&amp;#x4F60;&amp;#x597D;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;&amp;#x8FD0;&amp;#x7EF4;&amp;#xFF01;&amp;#x5728;&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x773C;&amp;#x91CC;&amp;#xFF0C;&amp;#x8FD0;&amp;#x7EF4;&amp;#x548C;&amp;#x6253;&amp;#x6742;&amp;#x7684;&amp;#x6CA1;&amp;#x6709;&amp;#x4EFB;&amp;#x4F55;">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    sidebar: {"position":"left","display":"post","offset":12,"offset_float":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: true,
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://c.isme.pub/2017/10/11/iamops/"/>





  <title>你好，我是运维！ | Casstiel</title>
  





  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "https://hm.baidu.com/hm.js?fbfcc29af2c51d3c6b19428ad2c49df2";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>










</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">Casstiel</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <p class="site-subtitle">普罗米修斯</p>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="javascript:;" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup search-popup local-search-popup">
  <div class="local-search-header clearfix">
    <span class="search-icon">
      <i class="fa fa-search"></i>
    </span>
    <span class="popup-btn-close">
      <i class="fa fa-times-circle"></i>
    </span>
    <div class="local-search-input-wrapper">
      <input autocomplete="off"
             placeholder="搜索..." spellcheck="false"
             type="text" id="local-search-input">
    </div>
  </div>
  <div id="local-search-result"></div>
</div>



    </div>
  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://c.isme.pub/2017/10/11/iamops/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="Casstiel">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/img/avatar.jpg">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="Casstiel">
    </span>

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">你好，我是运维！</h1>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2017-10-11T14:41:20+08:00">
                2017-10-11
              </time>
            

            
              <span class="post-meta-divider">|</span>
            

            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-check-o"></i>
              </span>
              
                <span class="post-meta-item-text">更新于</span>
              
              <time title="更新于" itemprop="dateModified" datetime="2017-10-11T14:41:20+08:00">
                2017-10-11
              </time>
            
          </span>

          

          
            
          

          
          

          
            <span class="post-meta-divider">|</span>
            <span class="page-pv"><i class="fa fa-file-o"></i>
            <span class="busuanzi-value" id="busuanzi_value_page_pv" ></span>
            </span>
          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <h1 id="&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x8FD0;&#x7EF4;&#xFF01;"><a href="#&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x8FD0;&#x7EF4;&#xFF01;" class="headerlink" title="&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x8FD0;&#x7EF4;&#xFF01;"></a>&#x4F60;&#x597D;&#xFF0C;&#x6211;&#x662F;&#x8FD0;&#x7EF4;&#xFF01;</h1><p>&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x773C;&#x91CC;&#xFF0C;&#x8FD0;&#x7EF4;&#x548C;&#x6253;&#x6742;&#x7684;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x73B0;&#x5728;&#x7684;&#x5927;&#x73AF;&#x5883;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7D20;&#x8D28;&#x4F4E;&#x4E0B;&#x7684;&#x975E;&#x4E3B;&#x6D41;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x5927;&#x6279;&#x6D8C;&#x5165;IT&#x884C;&#x4E1A;&#xFF0C;&#x53EA;&#x4F1A;&#x4E00;&#x70B9;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x91CC;&#x5B66;&#x6765;&#x7684;&#x642C;&#x7816;&#x6280;&#x672F;&#x5C31;&#x6562;&#x6F2B;&#x5929;&#x8981;&#x4EF7;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x628A;&#x5176;&#x4ED6;&#x4EBA;&#x653E;&#x5728;&#x773C;&#x91CC;&#xFF08;&#x5F53;&#x7136;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#x8FD9;&#x91CC;&#x9762;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x826F;&#x624D;&#x7684;&#xFF0C;&#x73BB;&#x7483;&#x5FC3;&#x8BF7;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#xFF09;&#x3002;</p>
<a id="more"></a>
<p>&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x773C;&#x4E2D;&#xFF0C;&#x8FD0;&#x7EF4;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x5976;&#x5988;&#x4E00;&#x6837;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ED6;&#x4EEC;&#x6765;&#x8BF4;&#xFF1A;&#x8FD0;&#x7EF4;&#x662F;&#x7F51;&#x7BA1;&#xFF1B;&#x8FD0;&#x7EF4;&#x662F;&#x6253;&#x6742;&#x7684;&#xFF1B;&#x8FD0;&#x7EF4;&#x662F;&#x80CC;&#x9505;&#x7684;&#xFF1B;&#x8FD0;&#x7EF4;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF08;&#x5475;&#x5475;&#xFF09;&#xFF0C;&#x5C31;&#x7B97;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;&#x4E5F;&#x6BEB;&#x4E0D;&#x6000;&#x7591;&#x7684;&#x628A;&#x8D23;&#x4EFB;&#x63A8;&#x7ED9;&#x8FD0;&#x7EF4;&#x3001;&#x5C31;&#x7B97;&#x662F;&#x642C;&#x7816;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x4E86;&#x70B9;&#x95EE;&#x9898;&#x4E5F;&#x61D2;&#x5F97;&#x52A8;&#x7528;&#x4ED6;&#x4EEC;&#x9AD8;&#x8D35;&#x7684;&#x624B;&#x6307;&#x53BB;&#x95EE;&#x5EA6;&#x5A18;&#x3001;&#x8C37;&#x54E5;&#x800C;&#x628A;&#x95EE;&#x9898;&#x63A8;&#x7ED9;&#x201C;&#x4E07;&#x80FD;&#x201D;&#x7684;&#x8FD0;&#x7EF4;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4EBA;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x77E5;&#x9053;&#x4EE3;&#x7801;&#x662F;&#x600E;&#x4E48;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x53EA;&#x4F1A;&#x62FF;&#x522B;&#x4EBA;&#x7684;&#x6765;&#x7528;&#xFF0C;&#x6709;&#x4E9B;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x7528;&#xFF1B;&#x8FD9;&#x4E9B;&#x4EBA;&#x6709;&#x5F88;&#x591A;&#x89C6;&#x6D41;&#x7A0B;&#x4E3A;&#x65E0;&#x7269;&#x3001;&#x89C6;&#x89C4;&#x8303;&#x5982;&#x65E0;&#x7269;&#x3001;&#x89C6;&#x673A;&#x5236;&#x5982;&#x65E0;&#x7269;&#xFF0C;&#x81EA;&#x5DF1;&#x60F3;&#x600E;&#x4E48;&#x6765;&#x5C31;&#x600E;&#x4E48;&#x6765;&#xFF0C;&#x4E3A;&#x8FBE;&#x76EE;&#x7684;&#x201C;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x201D;&#x3002;</p>
<p>&#x4E3E;&#x51E0;&#x4E2A;&#x201C;&#x6817;&#x5B50;&#x201D;&#x5427;&#xFF0C;&#x7B97;&#x4E86;&#x8FD8;&#x662F;&#x4E0D;&#x4E3E;&#x4E86;&#xFF0C;&#x4E00;&#x95ED;&#x773C;&#x8111;&#x6D77;&#x91CC;&#x90FD;&#x662F;&#x90A3;&#x5E2E;&#x70E7;&#x997C;&#x7684;&#x58EE;&#x4E3E;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x8BF4;&#x4E5F;&#x7F62;&#xFF0C;&#x53CD;&#x6B63;&#x8BE5;&#x61C2;&#x7684;&#x90FD;&#x61C2;&#xFF0C;&#x4F3C;&#x61C2;&#x975E;&#x61C2;&#x7684;&#x5E94;&#x8BE5;&#x65E9;&#x665A;&#x90FD;&#x4F1A;&#x61C2;&#xFF0C;&#x8C01;&#x8FD8;&#x6CA1;&#x78B0;&#x5230;&#x8FC7;&#x51E0;&#x4E2A;&#x7A00;&#x6709;&#x54C1;&#x79CD;&#x3002;&#x81F3;&#x4E8E;&#x90A3;&#x4E9B;&#x61C2;&#x4E86;&#x53C8;&#x4E0D;&#x60F3;&#x61C2;&#x7684;&#x5C31;&#x81EA;&#x5DF1;&#x5BF9;&#x53F7;&#x5165;&#x5EA7;&#x5427;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x9020;&#x6210;&#x4E86;&#x73B0;&#x5728;&#x7684;&#x5C40;&#x9762;&#xFF0C;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x8BA9;&#x6211;&#x4EEC;&#x6D6A;&#x8D39;&#x4E86;&#x65E0;&#x6570;&#x7684;&#x53E3;&#x820C;&#x8FD8;&#x88AB;&#x4EBA;&#x6307;&#x7740;&#x540E;&#x80CC;&#x5632;&#x7B11;&#x5462;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x5427;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<p>&#x73AF;&#x5883;&#x662F;&#x4E00;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x884C;&#x4E1A;&#x53D1;&#x5C55;&#x592A;&#x5FEB;&#xFF0C;&#x5927;&#x6279;&#x65E0;&#x4E1A;&#x4EBA;&#x5458;&#x80E1;&#x4E71;&#x5B66;&#x4E86;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x4E4B;&#x540E;&#x6D8C;&#x5165;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x3002;&#xFF08;&#x5F53;&#x7136;&#x8FD9;&#x4E5F;&#x662F;&#x6709;&#x5F88;&#x591A;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#x524D;&#x8F88;&#x4EEC;&#x9119;&#x89C6;&#x8FD9;&#x4E9B;&#x4EBA;&#x7684;&#x4E3B;&#x56E0;&#xFF0C;&#x8BDD;&#x8BF4;&#x56DE;&#x6765;&#x672C;&#x4EBA;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x8FDB;&#x6765;&#x7684;&#x5462;&#xFF08;&#x7B11;&#xFF09;&#xFF01;&#xFF09;&#x8FD9;&#x4E9B;&#x4EBA;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x6C34;&#x5E73;&#x786E;&#x5B9E;&#x5F88;&#x5DEE;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x4EBA;&#x80AF;&#x523B;&#x82E6;&#x5B66;&#x4E60;&#xFF0C;&#x4E30;&#x5BCC;&#x4E86;&#x81EA;&#x5DF1;&#x54EA;&#x6015;&#x201C;&#x51FA;&#x8EAB;&#x4E0D;&#x597D;&#x201D;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x4E22;&#x4EBA;&#xFF0C;&#x4F46;&#x81EA;&#x5DF1;&#x613F;&#x610F;&#x523B;&#x82E6;&#x7684;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x5C11;&#x6570;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x516C;&#x53F8;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x521A;&#x8FDB;&#x5165;&#x516C;&#x53F8;&#x8FD8;&#x4E0D;&#x719F;&#x6089;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x7684;&#x4EBA;&#x8FDB;&#x884C;&#x57FA;&#x672C;&#x7684;&#x6280;&#x672F;&#x57F9;&#x8BAD;&#x5462;&#xFF1F;&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;&#x4E0D;&#x540C;&#x516C;&#x53F8;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x3001;&#x5236;&#x5B9A;&#x7684;&#x89C4;&#x8303;&#x548C;&#x6D41;&#x7A0B;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x8FD8;&#x662F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x78B0;&#x5230;&#x95EE;&#x9898;&#x627E;&#x8FD0;&#x7EF4;&#x561B;&#xFF0C;&#x4F60;&#x8BF4;&#x662F;&#x5427;&#xFF01;</p>
<p>&#x8FD0;&#x7EF4;&#x5728;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x4E2D;&#x627F;&#x62C5;&#x7740;&#x5982;&#x7480;&#x74A8;&#x7E41;&#x661F;&#x822C;&#x7684;&#x5730;&#x4F4D;&#xFF0C;&#x505A;&#x7740;&#x6700;&#x524D;&#x7EBF;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x53D7;&#x7740;&#x6700;&#x540E;&#x7EBF;&#x7684;&#x6C14;&#xFF1B;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x662F;&#x4F60;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x5F53;&#x7136;&#x662F;&#x4F60;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x6742;&#x4E03;&#x6742;&#x516B;&#x94C1;&#x5B9A;&#x662F;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F00;&#x53D1;&#x603B;&#x4E5F;&#x95EE;&#x4E00;&#x4E9B;&#x557C;&#x7B11;&#x7686;&#x975E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x4ED6;&#x8BA4;&#x4E3A;&#x7684;&#x95EE;&#x9898;&#x6254;&#x7ED9;&#x4F60;&#x89E3;&#x51B3;&#xFF0C;&#x54EA;&#x6015;&#x8FD9;&#x4E2A;&#x4E8B;&#x8DDF;&#x4F60;&#x4E00;&#x70B9;&#x5173;&#x7CFB;&#x90FD;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x5212;&#x6E05;&#x754C;&#x9650;&#xFF0C;&#x786E;&#x5B9A;&#x8D23;&#x4EFB;&#x3002;&#x54EA;&#x4E9B;&#x662F;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x4F60;&#x627E;&#x6211;&#xFF1B;&#x54EA;&#x4E9B;&#x4E0D;&#x662F;&#x6211;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x4E0D;&#x4F1A;&#x7528;&#x4F60;&#x81EA;&#x5DF1;&#x53BB;&#x5B66;&#x522B;&#x6765;&#x95EE;&#x6211;&#xFF1B;&#x54EA;&#x4E9B;&#x4EFB;&#x52A1;&#x6211;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x5B9E;&#x73B0;&#xFF1B;&#x54EA;&#x4E9B;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0D;&#x8BA9;&#x6211;&#x4EEC;&#x53C2;&#x4E0E;&#x4F60;&#x5C31;&#x7ED9;&#x51FA;&#x8BF4;&#x660E;&#x548C;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#xFF1B;&#x54EA;&#x4E9B;&#x89C4;&#x5B9A;&#x548C;&#x6D41;&#x7A0B;&#x5236;&#x5B9A;&#x7684;&#x5C31;&#x8981;&#x6267;&#x884C;&#x3002;&#x7B49;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x8981;&#x4E0D;&#x8981;&#x5728;&#x4F60;&#x521A;&#x6765;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8DDF;&#x4F60;&#x8BF4;&#x660E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD0;&#x7EF4;&#x6BD5;&#x7ADF;&#x662F;&#x516C;&#x53F8;&#x76F8;&#x5BF9;&#x5E95;&#x5C42;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4F60;&#x5F88;&#x96BE;&#x7ED9;&#x516C;&#x53F8;&#x5E26;&#x6765;&#x660E;&#x9762;&#x4E0A;&#x7684;&#x6536;&#x76CA;&#xFF0C;&#x4F60;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x771F;&#x7684;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x5C31;&#x7B97;&#x5236;&#x5B9A;&#x4E86;&#x6D41;&#x7A0B;&#xFF0C;&#x4F18;&#x5316;&#x4E86;&#x67B6;&#x6784;&#xFF0C;&#x5F00;&#x53D1;&#x4E86;&#x7CFB;&#x7EDF;&#x4E5F;&#x53EA;&#x662F;&#x4F60;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x53EF;&#x7B11;&#x7684;&#x662F;&#x4EBA;&#x5BB6;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x914D;&#x5408;&#x4E5F;&#x4E0D;&#x662F;&#x4F60;&#x80FD;&#x505A;&#x7684;&#x4E86;&#x4E3B;&#x7684;&#x3002;</p>
<p>&#x5199;&#x70B9;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x53D1;&#x6CC4;&#x4E00;&#x4E9B;&#x60C5;&#x7EEA;&#xFF0C;&#x4F46;&#x4EBA;&#x5FAE;&#x8A00;&#x8F7B;&#xFF0C;&#x5F88;&#x96BE;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF0C;&#x6BD5;&#x7ADF;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x4E5F;&#x5C31;&#x90A3;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6587;&#x5C31;&#x6B64;&#x7ED3;&#x675F;&#x5427;&#xFF01;</p>
<p>&#x4EC0;&#x4E48;&#x662F;&#x8FD0;&#x7EF4;&#xFF1F;</p>
<p>&#x8FD0;&#x7EF4;&#x5C31;&#x5982;&#x540C;&#x7E41;&#x661F;&#x661F;&#x661F;&#x70B9;&#x70B9;&#x5374;&#x65E0;&#x6CD5;&#x7167;&#x4EAE;&#x5929;&#x7A7A;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x7E41;&#x661F;&#xFF0C;&#x591A;&#x4E00;&#x4E2A;&#x5C11;&#x4E00;&#x4E2A;&#x4E5F;&#x65E0;&#x6240;&#x8C13;&#xFF0C;&#x4F60;&#x8BF4;&#x662F;&#x5427;&#x3002;</p>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2017/09/21/mysql-install/" rel="next" title="mysql-install">
                <i class="fa fa-chevron-left"></i> mysql-install
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/11/17/mysql-utilities-install/" rel="prev" title="mysql-utilities-install">
                mysql-utilities-install <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/img/avatar.jpg"
               alt="Casstiel" />
          <p class="site-author-name" itemprop="name">Casstiel</p>
           
              <p class="site-description motion-element" itemprop="description"></p>
          
        </div>
        <nav class="site-state motion-element">

          
            <div class="site-state-item site-state-posts">
              <a href="/archives">
                <span class="site-state-item-count">99</span>
                <span class="site-state-item-name">日志</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-categories">
              <a href="/categories/index.html">
                <span class="site-state-item-count">47</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            
            
            <div class="site-state-item site-state-tags">
              <a href="/tags/index.html">
                <span class="site-state-item-count">72</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/ooppwwqq0" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                    
                      GitHub
                    
                </a>
              </span>
            
          
        </div>

        
        

        
        

        


      </section>

      
      <!--noindex-->
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">

            
              
            

            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#你好，我是运维！"><span class="nav-number">1.</span> <span class="nav-text">你好，我是运维！</span></a></li></ol></div>
            

          </div>
        </section>
      <!--/noindex-->
      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2016 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">Casstiel</span>
</div>


<div class="powered-by">
  由 <a class="theme-link" href="https://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>


        
<div class="busuanzi-count">
  <script async src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js"></script>

  
    <span class="site-uv">
      <i class="fa fa-user"></i>
      <span class="busuanzi-value" id="busuanzi_value_site_uv"></span>
      
    </span>
  

  
    <span class="site-pv">
      <i class="fa fa-eye"></i>
      <span class="busuanzi-value" id="busuanzi_value_site_pv"></span>
      
    </span>
  
</div>


        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.2"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.2"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.2"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.2"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.2"></script>



  


  




	





  





  






  

  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    var isXml = true;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length === 0) {
      search_path = "search.xml";
    } else if (/json$/i.test(search_path)) {
      isXml = false;
    }
    var path = "/" + search_path;
    // monitor main search box;

    var onPopupClose = function (e) {
      $('.popup').hide();
      $('#local-search-input').val('');
      $('.search-result-list').remove();
      $('#no-result').remove();
      $(".local-search-pop-overlay").remove();
      $('body').css('overflow', '');
    }

    function proceedsearch() {
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay"></div>')
        .css('overflow', 'hidden');
      $('.search-popup-overlay').click(onPopupClose);
      $('.popup').toggle();
      var $localSearchInput = $('#local-search-input');
      $localSearchInput.attr("autocapitalize", "none");
      $localSearchInput.attr("autocorrect", "off");
      $localSearchInput.focus();
    }

    // search function;
    var searchFunc = function(path, search_id, content_id) {
      'use strict';

      // start loading animation
      $("body")
        .append('<div class="search-popup-overlay local-search-pop-overlay">' +
          '<div id="search-loading-icon">' +
          '<i class="fa fa-spinner fa-pulse fa-5x fa-fw"></i>' +
          '</div>' +
          '</div>')
        .css('overflow', 'hidden');
      $("#search-loading-icon").css('margin', '20% auto 0 auto').css('text-align', 'center');

      $.ajax({
        url: path,
        dataType: isXml ? "xml" : "json",
        async: true,
        success: function(res) {
          // get the contents from search data
          isfetched = true;
          $('.popup').detach().appendTo('.header-inner');
          var datas = isXml ? $("entry", res).map(function() {
            return {
              title: $("title", this).text(),
              content: $("content",this).text(),
              url: $("url" , this).text()
            };
          }).get() : res;
          var input = document.getElementById(search_id);
          var resultContent = document.getElementById(content_id);
          var inputEventFunction = function() {
            var searchText = input.value.trim().toLowerCase();
            var keywords = searchText.split(/[\s\-]+/);
            if (keywords.length > 1) {
              keywords.push(searchText);
            }
            var resultItems = [];
            if (searchText.length > 0) {
              // perform local searching
              datas.forEach(function(data) {
                var isMatch = false;
                var hitCount = 0;
                var searchTextCount = 0;
                var title = data.title.trim();
                var titleInLowerCase = title.toLowerCase();
                var content = data.content.trim().replace(/<[^>]+>/g,"");
                var contentInLowerCase = content.toLowerCase();
                var articleUrl = decodeURIComponent(data.url);
                var indexOfTitle = [];
                var indexOfContent = [];
                // only match articles with not empty titles
                if(title != '') {
                  keywords.forEach(function(keyword) {
                    function getIndexByWord(word, text, caseSensitive) {
                      var wordLen = word.length;
                      if (wordLen === 0) {
                        return [];
                      }
                      var startPosition = 0, position = [], index = [];
                      if (!caseSensitive) {
                        text = text.toLowerCase();
                        word = word.toLowerCase();
                      }
                      while ((position = text.indexOf(word, startPosition)) > -1) {
                        index.push({position: position, word: word});
                        startPosition = position + wordLen;
                      }
                      return index;
                    }

                    indexOfTitle = indexOfTitle.concat(getIndexByWord(keyword, titleInLowerCase, false));
                    indexOfContent = indexOfContent.concat(getIndexByWord(keyword, contentInLowerCase, false));
                  });
                  if (indexOfTitle.length > 0 || indexOfContent.length > 0) {
                    isMatch = true;
                    hitCount = indexOfTitle.length + indexOfContent.length;
                  }
                }

                // show search results

                if (isMatch) {
                  // sort index by position of keyword

                  [indexOfTitle, indexOfContent].forEach(function (index) {
                    index.sort(function (itemLeft, itemRight) {
                      if (itemRight.position !== itemLeft.position) {
                        return itemRight.position - itemLeft.position;
                      } else {
                        return itemLeft.word.length - itemRight.word.length;
                      }
                    });
                  });

                  // merge hits into slices

                  function mergeIntoSlice(text, start, end, index) {
                    var item = index[index.length - 1];
                    var position = item.position;
                    var word = item.word;
                    var hits = [];
                    var searchTextCountInSlice = 0;
                    while (position + word.length <= end && index.length != 0) {
                      if (word === searchText) {
                        searchTextCountInSlice++;
                      }
                      hits.push({position: position, length: word.length});
                      var wordEnd = position + word.length;

                      // move to next position of hit

                      index.pop();
                      while (index.length != 0) {
                        item = index[index.length - 1];
                        position = item.position;
                        word = item.word;
                        if (wordEnd > position) {
                          index.pop();
                        } else {
                          break;
                        }
                      }
                    }
                    searchTextCount += searchTextCountInSlice;
                    return {
                      hits: hits,
                      start: start,
                      end: end,
                      searchTextCount: searchTextCountInSlice
                    };
                  }

                  var slicesOfTitle = [];
                  if (indexOfTitle.length != 0) {
                    slicesOfTitle.push(mergeIntoSlice(title, 0, title.length, indexOfTitle));
                  }

                  var slicesOfContent = [];
                  while (indexOfContent.length != 0) {
                    var item = indexOfContent[indexOfContent.length - 1];
                    var position = item.position;
                    var word = item.word;
                    // cut out 100 characters
                    var start = position - 20;
                    var end = position + 80;
                    if(start < 0){
                      start = 0;
                    }
                    if (end < position + word.length) {
                      end = position + word.length;
                    }
                    if(end > content.length){
                      end = content.length;
                    }
                    slicesOfContent.push(mergeIntoSlice(content, start, end, indexOfContent));
                  }

                  // sort slices in content by search text's count and hits' count

                  slicesOfContent.sort(function (sliceLeft, sliceRight) {
                    if (sliceLeft.searchTextCount !== sliceRight.searchTextCount) {
                      return sliceRight.searchTextCount - sliceLeft.searchTextCount;
                    } else if (sliceLeft.hits.length !== sliceRight.hits.length) {
                      return sliceRight.hits.length - sliceLeft.hits.length;
                    } else {
                      return sliceLeft.start - sliceRight.start;
                    }
                  });

                  // select top N slices in content

                  var upperBound = parseInt('1');
                  if (upperBound >= 0) {
                    slicesOfContent = slicesOfContent.slice(0, upperBound);
                  }

                  // highlight title and content

                  function highlightKeyword(text, slice) {
                    var result = '';
                    var prevEnd = slice.start;
                    slice.hits.forEach(function (hit) {
                      result += text.substring(prevEnd, hit.position);
                      var end = hit.position + hit.length;
                      result += '<b class="search-keyword">' + text.substring(hit.position, end) + '</b>';
                      prevEnd = end;
                    });
                    result += text.substring(prevEnd, slice.end);
                    return result;
                  }

                  var resultItem = '';

                  if (slicesOfTitle.length != 0) {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + highlightKeyword(title, slicesOfTitle[0]) + "</a>";
                  } else {
                    resultItem += "<li><a href='" + articleUrl + "' class='search-result-title'>" + title + "</a>";
                  }

                  slicesOfContent.forEach(function (slice) {
                    resultItem += "<a href='" + articleUrl + "'>" +
                      "<p class=\"search-result\">" + highlightKeyword(content, slice) +
                      "...</p>" + "</a>";
                  });

                  resultItem += "</li>";
                  resultItems.push({
                    item: resultItem,
                    searchTextCount: searchTextCount,
                    hitCount: hitCount,
                    id: resultItems.length
                  });
                }
              })
            };
            if (keywords.length === 1 && keywords[0] === "") {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>'
            } else if (resultItems.length === 0) {
              resultContent.innerHTML = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>'
            } else {
              resultItems.sort(function (resultLeft, resultRight) {
                if (resultLeft.searchTextCount !== resultRight.searchTextCount) {
                  return resultRight.searchTextCount - resultLeft.searchTextCount;
                } else if (resultLeft.hitCount !== resultRight.hitCount) {
                  return resultRight.hitCount - resultLeft.hitCount;
                } else {
                  return resultRight.id - resultLeft.id;
                }
              });
              var searchResultList = '<ul class=\"search-result-list\">';
              resultItems.forEach(function (result) {
                searchResultList += result.item;
              })
              searchResultList += "</ul>";
              resultContent.innerHTML = searchResultList;
            }
          }

          if ('auto' === 'auto') {
            input.addEventListener('input', inputEventFunction);
          } else {
            $('.search-icon').click(inputEventFunction);
            input.addEventListener('keypress', function (event) {
              if (event.keyCode === 13) {
                inputEventFunction();
              }
            });
          }

          // remove loading animation
          $(".local-search-pop-overlay").remove();
          $('body').css('overflow', '');

          proceedsearch();
        }
      });
    }

    // handle and trigger popup window;
    $('.popup-trigger').click(function(e) {
      e.stopPropagation();
      if (isfetched === false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };
    });

    $('.popup-btn-close').click(onPopupClose);
    $('.popup').click(function(e){
      e.stopPropagation();
    });
    $(document).on('keyup', function (event) {
      var shouldDismissSearchPopup = event.which === 27 &&
        $('.search-popup').is(':visible');
      if (shouldDismissSearchPopup) {
        onPopupClose();
      }
    });
  </script>





  

  
<script>
(function(){
    var bp = document.createElement('script');
    var curProtocol = window.location.protocol.split(':')[0];
    if (curProtocol === 'https') {
        bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
    }
    else {
        bp.src = 'http://push.zhanzhang.baidu.com/push.js';
    }
    var s = document.getElementsByTagName("script")[0];
    s.parentNode.insertBefore(bp, s);
})();
</script>


  

  

  

  

</body>
</html>
